
## Plan Result




### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 6 to add, 2 to change, 6 to destroy.</code></pre>

* Update
  * azurerm_key_vault_secret.DB-URL[0]
  * module.key-vault.azurerm_monitor_diagnostic_setting.kv-ds
* Replace
  * azurerm_postgresql_flexible_server_configuration.extensions[0]
  * module.postgresql[0].azurerm_postgresql_flexible_server.pgsql_server
  * module.postgresql[0].azurerm_postgresql_flexible_server_configuration.pgsql_server_config[&#34;backslash_quote&#34;]
  * module.postgresql[0].azurerm_postgresql_flexible_server_database.pg_databases[&#34;dashboard&#34;]
  * module.postgresql[0].azurerm_postgresql_flexible_server_firewall_rule.pg_firewall_rules[&#34;grafana1&#34;]
  * module.postgresql[0].azurerm_postgresql_flexible_server_firewall_rule.pg_firewall_rules[&#34;grafana2&#34;]


<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_key_vault_secret.DB-URL[0] will be updated in-place
  ~ resource "azurerm_key_vault_secret" "DB-URL" {
        id                      = "https://dtsse-aat.vault.azure.net/secrets/db-url/9e60d17b6208497ab90f40c8bc7f490e"
        name                    = "db-url"
        tags                    = {}
      ~ value                   = (sensitive value)
        # (5 unchanged attributes hidden)
    }

  # azurerm_postgresql_flexible_server_configuration.extensions[0] must be replaced
-/+ resource "azurerm_postgresql_flexible_server_configuration" "extensions" {
      ~ id        = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/dtsse-dashboard-flexdb-data-aat/providers/Microsoft.DBforPostgreSQL/flexibleServers/dtsse-dashboard-flexdb-aat/configurations/azure.extensions" -> (known after apply)
        name      = "azure.extensions"
      ~ server_id = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/dtsse-dashboard-flexdb-data-aat/providers/Microsoft.DBforPostgreSQL/flexibleServers/dtsse-dashboard-flexdb-aat" # forces replacement -> (known after apply) # forces replacement
        # (1 unchanged attribute hidden)
    }

  # module.key-vault.azurerm_monitor_diagnostic_setting.kv-ds will be updated in-place
  ~ resource "azurerm_monitor_diagnostic_setting" "kv-ds" {
        id                         = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/dtsse-aat/providers/Microsoft.KeyVault/vaults/dtsse-aat|dtsse-aat"
        name                       = "dtsse-aat"
        # (2 unchanged attributes hidden)

      - log {
          - category = "AuditEvent" -> null
          - enabled  = true -> null

          - retention_policy {
              - days    = 14 -> null
              - enabled = true -> null
            }
        }
      - log {
          - category = "AzurePolicyEvaluationDetails" -> null
          - enabled  = false -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }
      + log {
          + category = "AuditEvent"
          + enabled  = true

          + retention_policy {
              + days    = 14
              + enabled = true
            }
        }

      - metric {
          - category = "AllMetrics" -> null
          - enabled  = false -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }

        # (1 unchanged block hidden)
    }

  # module.postgresql[0].azurerm_postgresql_flexible_server.pgsql_server must be replaced
-/+ resource "azurerm_postgresql_flexible_server" "pgsql_server" {
      + delegated_subnet_id           = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/cft-aat-network-rg/providers/Microsoft.Network/virtualNetworks/cft-aat-vnet/subnets/postgresql" # forces replacement
      ~ fqdn                          = "dtsse-dashboard-flexdb-aat.postgres.database.azure.com" -> (known after apply)
      ~ id                            = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/dtsse-dashboard-flexdb-data-aat/providers/Microsoft.DBforPostgreSQL/flexibleServers/dtsse-dashboard-flexdb-aat" -> (known after apply)
        name                          = "dtsse-dashboard-flexdb-aat"
      + private_dns_zone_id           = "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/resourceGroups/core-infra-intsvc-rg/providers/Microsoft.Network/privateDnsZones/private.postgres.database.azure.com" # forces replacement
      ~ public_network_access_enabled = true -> (known after apply)
        tags                          = {
            "BuiltFrom"           = "https://github.com/HMCTS/dtsse-shared-infrastructure.git"
            "application"         = "core"
            "businessArea"        = "CFT"
            "changeUrl"           = ""
            "contactSlackChannel" = "#reform-swe"
            "environment"         = "staging"
            "managedBy"           = "DTS Software Engineering"
        }
      - zone                          = "1" -> null
        # (10 unchanged attributes hidden)

      ~ high_availability {
          - standby_availability_zone = "2" -> null
            # (1 unchanged attribute hidden)
        }

        # (2 unchanged blocks hidden)
    }

  # module.postgresql[0].azurerm_postgresql_flexible_server_configuration.pgsql_server_config["backslash_quote"] must be replaced
-/+ resource "azurerm_postgresql_flexible_server_configuration" "pgsql_server_config" {
      ~ id        = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/dtsse-dashboard-flexdb-data-aat/providers/Microsoft.DBforPostgreSQL/flexibleServers/dtsse-dashboard-flexdb-aat/configurations/backslash_quote" -> (known after apply)
        name      = "backslash_quote"
      ~ server_id = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/dtsse-dashboard-flexdb-data-aat/providers/Microsoft.DBforPostgreSQL/flexibleServers/dtsse-dashboard-flexdb-aat" # forces replacement -> (known after apply) # forces replacement
        # (1 unchanged attribute hidden)
    }

  # module.postgresql[0].azurerm_postgresql_flexible_server_database.pg_databases["dashboard"] must be replaced
-/+ resource "azurerm_postgresql_flexible_server_database" "pg_databases" {
      ~ charset   = "UTF8" -> "utf8"
      ~ id        = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/dtsse-dashboard-flexdb-data-aat/providers/Microsoft.DBforPostgreSQL/flexibleServers/dtsse-dashboard-flexdb-aat/databases/dashboard" -> (known after apply)
        name      = "dashboard"
      ~ server_id = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/dtsse-dashboard-flexdb-data-aat/providers/Microsoft.DBforPostgreSQL/flexibleServers/dtsse-dashboard-flexdb-aat" # forces replacement -> (known after apply) # forces replacement
        # (1 unchanged attribute hidden)
    }

  # module.postgresql[0].azurerm_postgresql_flexible_server_firewall_rule.pg_firewall_rules["grafana1"] must be replaced
-/+ resource "azurerm_postgresql_flexible_server_firewall_rule" "pg_firewall_rules" {
      ~ id               = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/dtsse-dashboard-flexdb-data-aat/providers/Microsoft.DBforPostgreSQL/flexibleServers/dtsse-dashboard-flexdb-aat/firewallRules/grafana1" -> (known after apply)
        name             = "grafana1"
      ~ server_id        = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/dtsse-dashboard-flexdb-data-aat/providers/Microsoft.DBforPostgreSQL/flexibleServers/dtsse-dashboard-flexdb-aat" # forces replacement -> (known after apply) # forces replacement
        # (2 unchanged attributes hidden)
    }

  # module.postgresql[0].azurerm_postgresql_flexible_server_firewall_rule.pg_firewall_rules["grafana2"] must be replaced
-/+ resource "azurerm_postgresql_flexible_server_firewall_rule" "pg_firewall_rules" {
      ~ id               = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/dtsse-dashboard-flexdb-data-aat/providers/Microsoft.DBforPostgreSQL/flexibleServers/dtsse-dashboard-flexdb-aat/firewallRules/grafana2" -> (known after apply)
        name             = "grafana2"
      ~ server_id        = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/dtsse-dashboard-flexdb-data-aat/providers/Microsoft.DBforPostgreSQL/flexibleServers/dtsse-dashboard-flexdb-aat" # forces replacement -> (known after apply) # forces replacement
        # (2 unchanged attributes hidden)
    }

Plan: 6 to add, 2 to change, 6 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","PRNumber":59,"Program":"tfcmt","SHA1":"","Vars":{}} -->